{
    "version": "https://jsonfeed.org/version/1",
    "title": "r4bbit",
    "home_page_url": "https://r4bbithole.github.io//",
    "feed_url": "https://r4bbithole.github.io//feed.json",
    "description": "Personal / educational blog",
    "icon": "https://r4bbithole.github.io//apple-touch-icon.png",
    "favicon": "https://r4bbithole.github.io//favicon.ico",
    "expired": false,
    
    "author":  {
        "name": "r4bbit",
        "url": null,
        "avatar": null
    },
    
"items": [
    
        {
            "id": "https://r4bbithole.github.io//2021/06/06/pilot",
            "title": "Pilot",
            "summary": "My first ever blog post, intro to r4bbithole",
            "content_text": "So yeah. It’s finally happening. I’m writing my first blog post.You might not know who I am and there’s no about me page either. (Or is there? Lurk a bit more …) Anyways, you will not know anything about me mainly because I haven’t really done anything at all so far. At least not in security.I’m a 23 years old aspiring hacker from Hungary and this first blog spot is hopefully the start of my cybersecurity career. Or at least the first step towards a larger online presence in the community.I’ve been fighting a bit of depression for the better part of the last six years so I hope by creating a blog, writing about my studies and shenanigans and doing a semi regular live stream on twitch I can combat this sinkhole. Sharing my thoughts, personal experiences and professional progress should help with stress, right?Why am I writing this?My goals with this blog post is partially to introduce myself:  I’m into reversing, pwn and web hacking and I thoroughly enjoy playing CTFs and doing boxes on HackTheBox. I finished my bachelors in Computer Engineering at my local university but I started studying about programming and computer networks on my own way before I was even accepted into uni. I worked on several school projects at uni and got into security on my own.The other reason I created this post is to share links and experiences about studying security. So here they are:LinuxGet into Linux. Download Ubuntu, wipe your windows machine and start using Ubuntu. Or manjaro, you’ll thank me down the line (more tools are readily available on manjaro without having to build them). Yes, Linux has a certain … steeper learning curve but trust me, people will be amazed by how much you know about a system that makes you face soooo many problems. Every bump on the road is an opportunity for you to grow.ProgrammingYou’ll have to learn a bit about computers, there’s just no ways around this. One of the skills you have to acquire is programming. I suggest starting with python. I started with python.Now there’s a bit of a confusion around which language to start with. I learned python just because … By learning python you’ll learn the logic behind programming, without having to understand difficult syntactical nuances. This will allow you to get into C/C++ and other, lower level languages easier.I suggest you use codecademy to learn python. It was free when I used it but in case it’s not anymore you can mail me on my email address and I’ll look for an other programming site. Last time I used it I was able to make it until python classes, but you won’t have to go that far just now. (You sure can, but you might find it difficult to understand).The test I last did on codecademy was a simple game of torpedo. If you’re done with that, go to hackerrank. Keep doing exercises on here until you can’t feel your hands.You won’t learn too much about OOP and big programming trends, but you can get to the level where you’ll easily understand more complex programming problems.Computer networksThis one’s a pretty big one too. Let’s be honest here, I could direct you to CCNA and other such sites and certificates but there’s actually a silver bullet here. Just go and read The Top Down Approach to Networking. This book is the bible of networking (No joke). I’m gonna come up with a way to let you practice networking in an interactive manner (Like you’ll do with programming) but that will take time. Sit tight and wait for other blog posts … For now, the networking bible will suffice. (Maybe start reading about mininet). Get this knowledge inside your head.Digital technologyI know bit wise operations, registers and very low level and physical stuff sounds scary but trust me, it isn’t. I found two books that seemed like they’re worth checking out. One of them is actually a veeeeerry long ppt slideshow. While the other one is a legit book.Warning! I myself didn’t use these resources. I studied about these things at university but those courses are in hungarian … Keep in touch with the blog and I’ll look through these sources as much as soon as I can and maybe make an update post about whether or not these sources are TRULY worth reading. If you don’t understand everything no worries! You should understand bit wise operations, logic gates, boolean algebra, number representations and that’s it. Read through the rest like it’s interesting, try to understand it but you won’t necessarily need it. I don’t understand everything here myself.TimetableI caught myself worrying about the rate of my progress several times when I was a complete beginner. Don’t do this! I’m serious … DO NOT DO THIS! This guide will not help you become a hacker. This guide will help you become a Cybersecurity Professional … Has a different ring to it, doesn’t it?You’ll understand so much more about computers It’s not even funny. You’ll be able to research vulnerabilities, write your own exploits, debug and run them to get the root shell and make mad cash while doing so. But this process takes TIME. I got to a level where I could start working as an ethical hacker in more than 3 years. Be prepared to STRUGGLE a lot. So here’s a certain time table, this is by no means the plan you HAVE to follow, but this should let you make ample progress.            Time learning about a topic      The topic                  1 month      Getting into python on codecademy + Using linux              3 months      Solving challenges on Hackerrank + Using linux              3 months      Computer networks + Using linux              3 months      Digital technology      If you complete this and can solve the tasks I’ll be uploading in later blog posts. You’ll have to research C/C++, OOP Programming and Operating systems next. But please DO THE ABOVE MENTIONED TASKS BEFORE THAT.",
            "content_html": "<p>So yeah. It’s finally happening. I’m writing my first blog post.</p><p>You might not know who I am and there’s no <em>about</em> me page either. (Or is there? Lurk a bit more …) Anyways, you will not know anything about me mainly because I haven’t really done anything at all so far. At least not in security.</p><p>I’m a 23 years old aspiring hacker from Hungary and this first blog spot is hopefully the start of my cybersecurity career. Or at least the first step towards a larger online presence in the community.</p><p>I’ve been fighting a bit of depression for the better part of the last six years so I hope by creating a blog, writing about my studies and shenanigans and doing a semi regular live stream on twitch I can combat this sinkhole. Sharing my thoughts, personal experiences and professional progress should help with stress, right?</p><h1 id=\"why-am-i-writing-this\">Why am I writing this?</h1><p>My goals with this blog post is partially to introduce myself:</p><blockquote>  <p>I’m into reversing, pwn and web hacking and I thoroughly enjoy playing CTFs and doing boxes on HackTheBox. I finished my bachelors in Computer Engineering at my local university but I started studying about programming and computer networks on my own way before I was even accepted into uni. I worked on several school projects at uni and got into security on my own.</p></blockquote><p>The other reason I created this post is to share links and experiences about studying security. So here they are:</p><h1 id=\"linux\">Linux</h1><p>Get into Linux. Download Ubuntu, wipe your windows machine and start using <a href=\"https://ubuntu.com/\">Ubuntu</a>. Or <a href=\"https://manjaro.org/\">manjaro</a>, you’ll thank me down the line (more tools are readily available on manjaro without having to build them). Yes, Linux has a certain … steeper learning curve but trust me, people will be amazed by how much you know about a system that makes you face soooo many problems. Every bump on the road is an opportunity for you to grow.</p><h1 id=\"programming\">Programming</h1><p>You’ll have to learn a bit about computers, there’s just no ways around this. One of the skills you have to acquire is programming. I suggest starting with python. I started with <a href=\"https://www.python.org/about/gettingstarted/\">python</a>.</p><p>Now there’s a bit of a confusion around which language to start with. I learned python just because … By learning python you’ll learn the logic behind programming, without having to understand difficult syntactical nuances. This will allow you to get into C/C++ and other, lower level languages easier.</p><p>I suggest you use <a href=\"https://www.codecademy.com/\">codecademy</a> to learn python. It was free when I used it but in case it’s not anymore you can mail me on my email address and I’ll look for an other programming site. Last time I used it I was able to make it until python classes, but you won’t have to go that far just now. (You sure can, but you might find it difficult to understand).</p><p>The test I last did on codecademy was a simple game of torpedo. If you’re done with that, go to <a href=\"https://www.hackerrank.com/\">hackerrank</a>. Keep doing exercises on here until you can’t feel your hands.</p><p>You won’t learn too much about OOP and big programming trends, but you can get to the level where you’ll easily understand more complex programming problems.</p><h1 id=\"computer-networks\">Computer networks</h1><p>This one’s a pretty big one too. Let’s be honest here, I could direct you to CCNA and other such sites and certificates but there’s actually a silver bullet here. Just go and read <a href=\"https://people.cs.clemson.edu/~jmarty/courses/kurose/KuroseCh1-2.pdf\">The Top Down Approach to Networking</a>. This book is the bible of networking (No joke). I’m gonna come up with a way to let you practice networking in an interactive manner (Like you’ll do with programming) but that will take time. Sit tight and wait for other blog posts … For now, the networking bible will suffice. (Maybe start reading about <a href=\"http://mininet.org/\">mininet</a>). Get this knowledge inside your head.</p><h1 id=\"digital-technology\">Digital technology</h1><p>I know bit wise operations, registers and very low level and physical stuff sounds scary but trust me, it isn’t. I found two books that seemed like they’re worth checking out. One of them is actually a <a href=\"http://www.vernon.eu/courses/David_Vernon_Introduction_to_Computer_Systems.pdf\">veeeeerry long ppt slideshow</a>. While the other one is a legit <a href=\"https://drive.google.com/file/d/116jvpXnLmbXVTMX6cnPMVQ57w3D6cCpr/view\">book</a>.<em>Warning!</em> I myself didn’t use these resources. I studied about these things at university but those courses are in hungarian … Keep in touch with the blog and I’ll look through these sources as much as soon as I can and maybe make an update post about whether or not these sources are TRULY worth reading. If you don’t understand everything no worries! You should understand bit wise operations, logic gates, boolean algebra, number representations and that’s it. Read through the rest like it’s interesting, try to understand it but you won’t necessarily need it. I don’t understand everything here myself.</p><h1 id=\"timetable\">Timetable</h1><p>I caught myself worrying about the rate of my progress several times when I was a complete beginner. Don’t do this! I’m serious … DO NOT DO THIS! This guide will not help you become a hacker. This guide will help you become a Cybersecurity Professional … Has a different ring to it, doesn’t it?</p><p>You’ll understand so much more about computers It’s not even funny. You’ll be able to research vulnerabilities, write your own exploits, debug and run them to get the root shell and make mad cash while doing so. But this process takes TIME. I got to a level where I could start working as an ethical hacker in more than 3 years. Be prepared to STRUGGLE a lot. So here’s a certain time table, this is by no means the plan you HAVE to follow, but this should let you make ample progress.</p><table>  <thead>    <tr>      <th>Time learning about a topic</th>      <th>The topic</th>    </tr>  </thead>  <tbody>    <tr>      <td>1 month</td>      <td>Getting into python on codecademy + Using linux</td>    </tr>    <tr>      <td>3 months</td>      <td>Solving challenges on Hackerrank + Using linux</td>    </tr>    <tr>      <td>3 months</td>      <td>Computer networks + Using linux</td>    </tr>    <tr>      <td>3 months</td>      <td>Digital technology</td>    </tr>  </tbody></table><p>If you complete this and can solve the tasks I’ll be uploading in later blog posts. You’ll have to research C/C++, OOP Programming and Operating systems next. But please <em>DO THE ABOVE MENTIONED TASKS BEFORE THAT</em>.</p>",
            "url": "https://r4bbithole.github.io//2021/06/06/pilot",
            
            
            
            
            
            "date_published": "2021-06-06T00:00:00+00:00",
            "date_modified": "2021-06-06T00:00:00+00:00",
            
                "author":  {
                "name": "r4bbit",
                "url": null,
                "avatar": null
                }
                
            
        }
    
    ]
}